import { Quiz } from "./components/Quiz"
import { Spoon } from "@/public/icons";

const EAT = () => {
    const items = [
        "مشکل بلع من باعث کاهش وزن شده است.",
        "مشکلات بلع من در توانایی من برای بیرون رفتن برای غذا اختلال ایجاد می کند.",
        "بلع مایعات نیاز به تلاش بیشتری دارد",
        "قورت دادن مواد جامد به تلاش بیشتری نیاز دارد.",
        "بلع دردناک است",
        "لذت غذا خوردن تحت تاثیر قورت دادن من است.",
        "وقتی غذا را قورت می دهم می چسبد در گلویم.",
        "وقتی گربه می گیرم سرفه می کنم.",
        "بلع استرس زا است",
      ];
    return (
        <Quiz title="EAT-10" items={items} icon={Spoon} />
    )
}

export default EAT;
